//=============================================================================
//
// バレットの爆発処理 [bullet_explosion.h]
// Author : GP11B132 13 黄源
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************



//*****************************************************************************
// 構造体定義
//*****************************************************************************
// バレット構造体
struct BULLET_EXPLOSION
{
	BOOL					use;					// true:使っている  false:未使用
	float					w, h;					// 幅と高さ
	D3DXVECTOR3				pos;					// バレットの座標
	D3DXVECTOR3				rot;					// バレットの回転量
	D3DXVECTOR3				move;					// バレットの移動量
	int						countAnim;				// アニメーションカウント
	int						patternAnim;			// アニメーションパターンナンバー
	int						texNo;					// 何番目のテクスチャーを使用するのか

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBullet_Explosion(void);
void UninitBullet_Explosion(void);
void UpdateBullet_Explosion(void);
void DrawBullet_Explosion(void);

//BULLET *GetBullet(void);
void SetBullet_Explosion(D3DXVECTOR3 pos);


