//=============================================================================
//
// バレット処理 [bullet.h]
// Author : GP11B132 13 黄源
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define BULLET_MAX		(10)			// バレットのMax数
#define BULLET_SPEED	(10.0f)			// バレットの移動スピード

enum
{
	DIR_BULLET_RIGHT =  1,
	DIR_BULLET_LEFT  = -1,
};


//*****************************************************************************
// 構造体定義
//*****************************************************************************
// バレット構造体
struct BULLET
{
	BOOL					use;					// true:使っている  false:未使用
	float					w, h;					// 幅と高さ
	D3DXVECTOR3				pos;					// バレットの座標
	D3DXVECTOR3				rot;					// バレットの回転量
	D3DXVECTOR3				move;					// バレットの移動量
	int						countAnim;				// アニメーションカウント
	int						patternAnim;			// アニメーションパターンナンバー
	int						texNo;					// 何番目のテクスチャーを使用するのか
	int						dir;					// 発射の方向

};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBullet(void);
void UninitBullet(void);
void UpdateBullet(void);
void DrawBullet(void);

BULLET *GetBullet(void);
void SetBullet(D3DXVECTOR3 pos,int dir);


